Repository: de-trustleap/trustleap-app
Catalog: lib/l10n/app_*.arb
Languages: de

# register_firstname
source: firstname
de: Vorname

# register_lastname
source: lastname
de: Name

# register_birthdate
source: birthdate
de: Geburtsdatum

# register_address
source: address (optional)
de: Straße u. Hausnummer (optional)

# register_postcode
source: postcode (optional)
de: PLZ (optional)

# register_place
source: place (optional)
de: Ort (optional)

# register_email
source: email address
de: E-Mail

# register_password
source: password
de: Passwort

# register_repeat_password
source: confirm password
de: Passwort bestätigen

# register_code
source: Registration code
de: Registrierungscode

# register_now_buttontitle
source: Rgister now
de: Jetzt Registrieren

# register_invalid_code_error
source: Registration failed. Please check whether you are using a valid code and the associated email address.
de: Die Registrierung ist fehlgeschlagen. Bitte prüfen Sie ob Sie einen gültigen Code und die zugehörige E-Mail Adresse verwenden.

# login_email
source: email address
de: E-Mail

# login_password
source: password
de: Passwort

# login_login_buttontitle
source: Login
de: Anmelden

# delete_buttontitle
source: delete
de: Löschen

# cancel_buttontitle
source: cancel
de: Abbrechen

# changes_save_button_title
source: save changes
de: Änderungen speichern

# login_password_forgotten_text
source: Do you have your
de: Haben Sie ihr

# login_password_forgotten_linktext
source: Password forgotten?
de: Passwort vergessen?

# login_register_linktitle
source: Register now
de: Jetzt registrieren

# login_register_text
source: You don''t have an account?
de: Du hast kein Konto?

# auth_validation_missing_email
source: Please enter an email address
de: Gib bitte eine E-Mail Adresse an

# auth_validation_invalid_email
source: Invalid email address
de: Ungültige E-Mail Adresse

# auth_validation_missing_password
source: Please enter a password
de: Bitte ein Password angeben

# auth_validation_confirm_password
source: Please confirm the password
de: Bitte das Passwort bestätigen

# auth_validation_matching_passwords
source: The passwords don''t match
de: Die Passwörter stimmen nicht überein

# auth_validation_missing_firstname
source: Please enter firstname
de: Bitte den Vornamen angeben

# auth_validation_long_firstname
source: The entered firstname is too long
de: Der angegebene Vorname ist zu lang

# auth_validation_missing_lastname
source: Please enter lastname
de: Bitte den Nachnamen angeben

# auth_validation_long_lastname
source: The entered lastname is too long
de: Der angegebene Nachname ist zu lang

# auth_validation_missing_birthdate
source: Please enter birthdate
de: Bitte das Geburtsdatum angeben

# auth_validation_invalid_birthdate
source: You must be 18 or older
de: Sie müssen 18 oder älter sein

# auth_validation_invalid_date
source: The entered date is invalid.
de: Das eingegebene Datum ist ungültig

# auth_validation_invalid_postcode
source: the postcode is invalid
de: Die PLZ ist ungültig

# auth_validation_missing_code
source: Please enter your registration code
de: Geben Sie bitte ihren Registrierungscode an

# auth_validation_missing_gender
source: Please indicate your gender
de: Geben Sie bitte ihr Geschlecht an

# auth_validation_missing_additional_info
source: reason for recommendation is missing
de: Bitte einen Empfehlungsgrund angeben

# auth_validation_additional_info_exceed_limit
source: You exceeded the maximal amount of 500 characters
de: Es sind maximal 500 Zeichen erlaubt

# menuitems_profile
source: Profile
de: Profil

# menuitems_recommendations
source: Recommendations
de: Empfehlungen

# landingpage_overview_title
source: Landing pages overview
de: Landing Pages Übersicht

# menuitems_company_requests
source: Requests
de: Anfragen

# landingpage_overview_error_view_title
source: An error occurred while retrieving the data.
de: Ein Fehler beim Abruf der Daten ist aufgetreten.

# landingpage_overview_empty_page_title
source: No landingpage found
de: Keine Landingpage gefunden

# landingpage_overview_empty_page_subtitle
source: Seems like you dont have a landing page yet. Create your landing page now.
de: Sie scheinen noch keine Landingpage zu haben. Erstellen Sie jetzt ihre Landingpage.

# landingpage_overview_empty_page_button_title
source: Register Landing Page
de: Landingpage registrieren

# landingpage_delete_alert_title
source: Do you really want to delete the selected landing page?
de: Soll die ausgewählte Landingpage wirklich gelöscht werden?

# landingpage_delete_alert_msg
source: Deleting the landing page cannot be undone.
de: Das Löschen der Landingpage kann nicht rückgängig gemacht werden.

# landingpage_success_delete_snackbar_message
source: Landing page successfully deleted!
de: Landinpage erfolgreich gelöscht!

# landingpage_snackbar_success
source: The landing page was successfully created!
de: Die Landingpage wurde erfolgreich erstellt!

# landingpage_snackbar_success_changed
source: The landing page was successfully changed!
de: Die Landingpage wurde erfolgreich geändert!

# landingpage_snackbar_success_duplicated
source: The landing page was successfully duplicated!
de: Die Landingpage wurde erfolgreich dupliziert!

# landingpage_snackbar_success_toggled_enabled
source: The landing page was successfully enabled!
de: Die Landingpage wurde erfolgreich aktiviert!

# landingpage_snackbar_success_toggled_disabled
source: The landing page was successfully disabled!
de: Die Landingpage wurde erfolgreich deaktiviert!

# landingpage_snackbar_failure_toggled
source: An error occurred while toggle the landing page
de: Beim umstellen der Landingpage ist ein Fehler aufgetreten

# landingpage_overview_context_menu_disable
source: disable
de: deaktivieren

# landingpage_overview_context_menu_enable
source: enable
de: aktivieren

# landingpage_overview_max_count_msg
source: Maximum number of landing pages reached
de: Maximale Anzahl an Landingpages wurde erreicht

# landingpage_create_buttontitle
source: Create Landing Page
de: Landingpage erstellen

# landingpage_validate_LandingPageName
source: Please enter a name!
de: Bitte Namen eingeben!

# landingpage_validate_LandingPageText
source: Please enter text!
de: Bitte Text eingeben!

# landingpage_validate_impressum
source: Please enter impressum
de: Bitte Impressum angeben

# landingpage_validate_privacy_policy
source: Please enter privacy policy
de: Bitte Datenschutzerklärung angeben

# landingpage_validate_initial_information
source: Please enter initial information
de: Bitte Erstinformation angeben

# landingpage_creation_progress_indicator_text
source: Step {currentStep} of {elementsTotal}
de: Schritt {currentStep} von {elementsTotal}

# landingpage_creation_privacy_policy_placeholder
source: Privacy policy
de: Datenschutzerklärung

# landingpage_creation_initial_information_placeholder
source: Initial information (optional)
de: Erstinformation

# landingpage_creation_back_button_text
source: Back
de: Zurück

# landingpage_creation_edit_button_text
source: Edit Landingpage
de: Landingpage anpassen

# landingpage_create_txt
source: Create Landing Page
de: Landingpage erstellen

# landingpage_creation_continue
source: Continue
de: Weiter

# landingpage_create_promotion_template_description
source: Below you can create a template that your promoters will use to send recommendations via WhatsApp. You can use different placeholders which you can choose from the placeholder menu.
de: Nachfolgend kannst du eine Vorlage erstellen, die deine Promoter nutzen werden um Empfehlungen per Whatsapp zu versenden. Du kannst den Platzhalter $name nutzen, um den Namen des Empfehlungsempfängers anzuzeigen.

# landingpage_create_promotion_template_placeholder
source: Template for promoter (optional)
de: Vorlage für Promoter (optional)

# landingpage_create_promotion_template_default_text
source: This is the promotion template.
de: Das ist eine Vorlage für Empfehlungen.

# emoji_search_placeholder
source: Search Emoji
de: Suche Emoji

# open_emoji_picker_tooltip
source: Open emoji picker
de: Emoji Picker öffnen

# landingpage_overview_context_menu_delete
source: Delete
de: Löschen

# landingpage_overview_context_menu_duplicate
source: Duplicate
de: Duplizieren

# placeholder_title
source: Title
de: Titel

# placeholder_description
source: Description
de: Beschreibung

# error_msg_pleace_upload_picture
source: Please upload an image
de: Bitte ein Bild hochladen

# menuitems_activities
source: Activities
de: Aktivitäten

# auth_failure_email_already_in_use
source: The email adress is already taken.
de: Die E-Mail Adresse ist bereits vergeben.

# auth_failure_invalid_email
source: The email address is invalid
de: Die eingegebene E-Mail Adresse ist ungültig.

# auth_failure_weak_password
source: The password is too weak. Please use at least 6 characters.
de: Das angegebene Passwort ist zu schwach. Bitte nutze mindestens 6 Zeichen.

# auth_failure_user_disabled
source: The user does not exist anymore. Please contact our support team for further investigation.
de: Der angegebene Nutzer existiert nicht mehr. Wenden Sie sich bitte an den Support.

# auth_failure_user_not_found
source: The user does not exist.
de: Der angegebene Nutzername existiert nicht.

# auth_failure_wrong_password
source: The entered password is not correct.
de: Das angegebene Passwort ist falsch.

# auth_failure_invalid_credentials
source: Your entered credentials do not exist.
de: Deine angegebenen Zugangsdaten existieren nicht.

# auth_failure_too_many_requests
source: You have entered your login details incorrectly too many times. Try again later.
de: Du hast deine Zugangsdaten zu oft falsch eingegeben. Versuche es später noch einmal.

# auth_failure_user_mismatch
source: Your login information does not belong to the current user.
de: Deine Anmeldeinformationen gehören nicht zum aktuellen User.

# auth_failure_invalid_verification_code
source: Your verification code is invalid.
de: Dein Verifizierungscode ist ungültig.

# auth_failure_invalid_verification_id
source: Your verification id is invalid.
de: Die ID zu deinen Anmeldeinformationen ist ungültig.

# auth_failure_requires_recent_login
source: Its been too long since you last logged in. Sign in again.
de: Deine letzte Anmeldung ist zu lange her. Melde dich erneut an.

# auth_failure_missing_password
source: You have to type in your password.
de: Du musst dein Password angeben.

# auth_failure_unknown
source: An unknown error occured.
de: Ein unbekannter Fehler ist aufgetreten.

# database_failure_permission_denied
source: Permission denied to access these resources.
de: Sie sind nicht berechtigt auf die Daten zuzugreifen.

# database_failure_not_found
source: The requested data was not found.
de: Die angefragten Daten wurden nicht gefunden.

# database_failure_already_exists
source: the data already exists.
de: Die angegebenen Daten existieren bereits.

# database_failure_deadline_exceeded
source: Data retrieval takes too long. Try again later.
de: Der Datenabruf dauert zu lange. Versuche es später nochmal.

# database_failure_cancelled
source: The operation has been cancelled.
de: Die Operation wurde abgebrochen.

# database_failure_unavailable
source: The service is currently unavailable.
de: Der Service ist gerade nicht erreichbar.

# database_failure_unknown
source: An unknown error occured.
de: Ein unbekannter Fehler ist aufgetreten.

# storage_failure_object_not_found
source: Image not found.
de: Es wurde kein Bild gefunden.

# storage_failure_not_authenticated
source: You are not logged in. Please login and try again.
de: Du musst dich anmelden um diesen Service nutzen zu können.

# storage_failure_not_authorized
source: You are not permitted to do this.
de: Du bist nicht berechtigt diese Aktion auszuführen.

# storage_failure_retry_limit_exceeded
source: There seems to be a problem. The action is taking longer than usual. Please try again later.
de: Es scheint ein Problem aufgetreten zu sein. Die Aktion dauert länger als gewöhnlich. Bitte versuche es später erneut.

# storage_failure_unknown
source: An unknown error occured. Please try again later.
de: Ein unbekannter Fehler ist aufgetreten. Bitte versuche es später erneut.

# password_forgotten_title
source: Reset password
de: Passwort zurücksetzen

# password_forgotten_description
source: Please enter your email address and confirm. A link will then be sent to the email address you provided. You can use this link to reset your password.
de: Bitte geben Sie ihre E-Mail Adresse ein und bestätigen Sie. Ihnen wird anschließend ein Link an die angegebene E-Mail Adresse gesendet. Über diesen Link können Sie ihr Passwort zurücksetzen.

# password_forgotten_success_dialog_title
source: Password reset succeeded
de: Passwort erfolgreich zurückgesetzt

# password_forgotten_success_dialog_description
source: An email has been sent to the email address provided. You can set your new password using the link in the email.
de: Eine E-Mail wurde an die angegebene E-Mail Adresse gesendet. Über den Link in der Mail können Sie ihr neues Passwort festlegen.

# password_forgotten_success_dialog_ok_button_title
source: Back to Login
de: Zurück zum Login

# password_forgotten_button_title
source: Reset password
de: Passwort zurücksetzen

# password_forgotten_email_textfield_placeholder
source: email address
de: E-Mail Adresse

# general_error_view_refresh_button_title
source: Try again
de: Erneut versuchen

# profile_page_email_section_description
source: Now enter your new email address and confirm. A confirmation link will then be sent to the new email address. You can use this link to verify your new email address and log in again.
de: Geben Sie jetzt ihre neue E-Mail Adresse an und bestätigen Sie. An die neue E-Mail Adresse wird anschließend ein Bestätigungslink gesendet. Durch diesen Link können Sie Ihre neue E-Mail Adresse verifizieren und sich erneut anmelden.

# profile_page_email_section_change_email_button_title
source: Change email address
de: E-Mail Adresse ändern

# profile_page_email_section_change_email_password_description
source: Please enter your password if you would like to change your email address.
de: Geben Sie bitte ihr Passwort ein wenn Sie ihre E-Mail Adresse ändern möchten.

# profile_page_email_section_change_email_password_continue_button_title
source: Continue
de: Weiter

# profile_page_email_section_resend_verify_email_button_title
source: Resend link for email verification
de: Link zur Email-Verifikation erneut senden

# profile_page_email_section_title
source: E-Mail Settings
de: E-Mail Einstellungen

# profile_page_email_section_verification_badge_verified
source: Verified
de: Verifiziert

# profile_page_image_section_validation_exceededFileSize
source: You have exceeded the maximum allowed size of 5 MB
de: Sie haben die zulässige Maximalgröße von 5 MB überschritten

# profile_page_image_section_validation_not_valid
source: The image format is invalid
de: Das ist kein gültiges Bildformat

# profile_page_image_section_only_one_allowed
source: You can only upload one image at a time
de: Du kannst nur ein Bild gleichzeitig hochladen

# profile_page_image_section_upload_not_found
source: The image to upload was not found
de: Das Bild zum Hochladen wurde nicht gefunden

# profile_page_image_section_large_image_view_close_button_tooltip_title
source: Close
de: Schließen

# profile_page_password_update_section_title
source: Change password
de: Passwort ändern

# profile_page_password_update_section_new_password_description
source: Please enter your new password and confirm it. You will then be logged out and you can log in with the new password.
de: Geben Sie bitte ihr neues Passwort an und bestätigen Sie es. Danach werden Sie ausgeloggt und Sie können sich mit dem neuen Passwort anmelden.

# profile_page_password_update_section_new_password_textfield_placeholder
source: New password
de: Neues Passwort

# profile_page_password_update_section_new_password_repeat_textfield_placeholder
source: Repeat new password
de: Neues Passwort wiederholen

# profile_page_password_update_section_new_password_confirm_button_text
source: Change password
de: Passwort ändern

# profile_page_password_update_section_reauth_description
source: Please enter your current password so that you can create a new password.
de: Geben Sie bitte ihr aktuelles Password ein damit Sie ein neues Password erstellen können.

# profile_page_password_update_section_reauth_password_textfield_placeholder
source: Password
de: Passwort

# profile_page_contact_section_title
source: Contact Information
de: Kontaktinformationen

# profile_page_contact_section_form_firstname
source: first name
de: Vorname

# profile_page_contact_section_form_lastname
source: last name
de: Nachname

# profile_page_contact_section_form_address
source: address
de: Straße und Hausnummer

# profile_page_contact_section_form_postcode
source: postcode
de: PLZ

# profile_page_contact_section_form_place
source: place
de: Ort

# profile_page_contact_section_form_save_button_title
source: Save changes
de: Änderungen speichern

# profile_page_snackbar_image_changed_message
source: You have successfully customized the profile picture.
de: Sie haben das Profilbild erfolgreich angepasst.

# profile_page_snackbar_contact_information_changes
source: The change to your contact information was successful.
de: Die Änderung deiner Kontaktinformationen war erfolgreich.

# profile_page_snackbar_email_verification
source: A link for email verification has been sent to you.
de: Es wurde ein Link zur E-Mail Verifikation an dich versendet.

# profile_page_snackbar_company_registered
source: The request for the company registration has been sent succesful.
de: Die Anfrage zur Unternehmensregistrierung wurde erfolgreich versendet.

# profile_page_logout_button_title
source: Logout
de: Abmelden

# profile_page_request_failure_message
source: An error occurred while retrieving the data.
de: Ein Fehler beim Abruf der Daten ist aufgetreten.

# profile_page_promoters_section_recommender_count
source: Number of promoters:
de: Anzahl der Promoter:

# gender_picker_choose
source: Choose your gender
de: Wählen Sie ihr Geschlecht

# gender_picker_not_choosen
source: Not choosen
de: Nicht ausgewählt

# gender_picker_male
source: Male
de: Männlich

# gender_picker_female
source: Female
de: Weiblich

# register_promoter_email_already_in_use
source: The email address already exists for another user.
de: Die E-Mail Adresse existiert bereits bei einem anderen Nutzer.

# register_promoter_title
source: Register promoter
de: Promoter registrieren

# register_promoter_first_name
source: firstname
de: Vorname

# register_promoter_last_name
source: lastname
de: Nachname

# register_promoter_email
source: email address
de: E-Mail Adresse

# register_promoter_additional_info
source: reason for the recommendation
de: Grund der Empfehlung

# register_promoter_register_button
source: Register
de: Registrieren

# register_promoter_snackbar_success
source: The new promoter has been successfully registered!
de: Der neue Promoter wurde erfolgreich registriert!

# register_promoter_no_landingpage_title
source: You have not created a landing page yet
de: Du hast noch keine Landingpage erstellt

# register_promoter_no_landingpage_subtitle
source: In order to create a new promoter it is necessary to have an active landing page.
de: Um einen neuen Promoter erstellen zu können ist es nötig, eine aktive Landingpage zu haben.

# register_promoter_missing_landingpage_error_message
source: The promoter has not yet been assigned a landing page
de: Dem Promoter wurde noch keine Landingpage zugewiesen

# register_promoter_missing_company_error_message
source: You cannot register a promoter because you are not affiliated with any company
de: Du kannst keinen Promoter registrieren, da du keinem Unternehmen zugehörig bist

# promoter_overview_title
source: My promoter
de: Meine Promoter

# promoter_overview_search_placeholder
source: Search...
de: Suche...

# promoter_overview_filter_show_all
source: Show all
de: Alle anzeigen

# promoter_overview_filter_show_registered
source: Show registered
de: Registrierte anzeigen

# promoter_overview_filter_show_unregistered
source: Show unregistered
de: Unregistrierte anzeigen

# promoter_overview_filter_sortby_choose
source: Sort by
de: Sortieren nach

# promoter_overview_filter_sortby_date
source: creation date
de: Erstellungsdatum

# promoter_overview_filter_sortby_firstname
source: firstname
de: Vorname

# promoter_overview_filter_sortby_lastname
source: lastname
de: Nachname

# promoter_overview_filter_sortby_email
source: email address
de: E-Mail Adresse

# promoter_overview_filter_sortorder_asc
source: Ascending
de: Aufsteigend

# promoter_overview_filter_sortorder_desc
source: Descending
de: Absteigend

# promoter_overview_no_search_results_title
source: No search results
de: Keine Suchergebnisse

# promoter_overview_no_search_results_subtitle
source: You don't seem to have registered any promoters with the name you're looking for yet. Change your search term to search for other promoters.
de: Sie scheinen noch keine Promoter mit dem gesuchten Namen registriert zu haben. Ändern Sie Ihren Suchbegriff um nach anderen Promotern zu suchen.

# promoter_overview_registration_badge_registered
source: Registered
de: Registriert

# promoter_overview_registration_badge_unregistered
source: Not registered
de: Nicht registriert

# promoter_overview_empty_page_title
source: No promoter found
de: Keine Promoter gefunden

# promoter_overview_empty_page_subtitle
source: You dont seem to have any promoters registered yet. Register your promoters now to win your first new customers.
de: Sie scheinen noch keine Promoter registriert zu haben. Registrieren Sie jetzt ihre Promoter um die ersten Neukunden zu gewinnen.

# promoter_overview_empty_page_button_title
source: Register promoter
de: Promoter registrieren

# promoter_overview_error_view_title
source: An error occurred while retrieving the data.
de: Ein Fehler beim Abruf der Daten ist aufgetreten.

# promoter_overview_expiration_date
source: expires at {date}
de: Läuft am {date} ab

# promoter_overview_creation_date
source: Member since {date}
de: Mitglied seit {date}

# delete_account_title
source: Delete account
de: Account löschen

# delete_account_subtitle
source: Once your account is deleted, your data will remain with us for 30 days. During this time you can still contact support to reverse the deletion. Your data will then be irrevocably deleted. Please enter your password to delete the account.
de: Mit der Löschung Ihres Accounts verbleiben Ihre Daten noch 30 Tage bei uns. In dieser Zeit können Sie sich noch beim Support melden um die Löschung rückgängig zu machen. Danach werden Ihre Daten unwiderruflich gelöscht sein. Geben Sie bitte ihr Passwort ein um den Account zu löschen.

# delete_account_password_placeholder
source: Password
de: Passwort

# delete_account_button_title
source: Delete account
de: Account löschen

# delete_account_confirmation_alert_title
source: Really delete your account?
de: Account wirklich löschen?

# delete_account_confirmation_alert_message
source: Are you sure you want to delete your account?
de: Sind Sie sicher dass Sie ihren Account löschen möchten?

# delete_account_confirmation_alert_ok_button_title
source: Delete account
de: Account löschen

# delete_account_confirmation_alert_cancel_button_title
source: Cancel
de: Abbrechen

# recommendations_choose_reason_placeholder
source: Choose a reason
de: Wähle einen Grund

# recommendations_choose_reason_not_chosen
source: Not chosen
de: Nicht ausgewählt

# recommendations_title
source: Generate recommendations
de: Empfehlungen generieren

# recommendations_form_service_provider_placeholder
source: Service provider
de: Dienstleister

# recommendations_form_recommendation_name_placeholder
source: Recommendation name
de: Empfehlungsname
