Repository: de-trustleap/trustleap-app
Catalog: lib/l10n/app_*.arb
Languages: de

# recommendations_form_generate_recommendation_button_title
source: Generate recommendations
de: Empfehlungen generieren

# recommendations_error_view_title
source: An error occurred while retrieving the data
de: Beim Abrufen der Daten ist ein Fehler aufgetreten

# recommendations_validation_missing_lead_name
source: Please enter a name
de: Geben Sie bitte einen Namen an

# recommendations_validation_missing_promoter_name
source: Please enter a name
de: Geben Sie bitte einen Namen an

# recommendations_validation_missing_reason
source: Please enter a reason
de: Bitte einen Grund angeben

# profile_company_contact_section_title
source: Company Information
de: Unternehmensinformationen

# profile_company_contact_section_name
source: Company name
de: Unternehmensbezeichnung

# profile_company_contact_section_industry
source: Industry
de: Branche

# profile_company_contact_section_website
source: Website
de: Webseite

# profile_company_contact_section_address
source: Address
de: Straße und Hausnummer

# profile_company_contact_section_postcode
source: Postcode
de: PLZ

# profile_company_contact_section_place
source: Place
de: Ort

# profile_company_contact_section_phone
source: Phone
de: Telefonnummer

# profile_company_validator_missing_name
source: Please enter the company name
de: Bitte den Unternehmensnamen angeben

# profile_company_validator_missing_industry
source: Please enter the industry
de: Bitte die Branche angeben

# profile_company_validator_invalid_phone
source: The phone number is invalid
de: Die angegebene Telefonnummer ist ungültig

# profile_company_validator_missing_address
source: Please enter the address
de: Bitte eine Adresse angeben

# profile_company_validator_missing_postCode
source: Please enter a postcode
de: Bitte eine PLZ angeben

# profile_company_validator_invalid_postCode
source: The postcode is invalid
de: Die PLZ ist ungültig

# profile_company_validator_missing_place
source: Please enter a place
de: Bitte einen Ort angeben

# profile_company_validator_missing_phone
source: Please enter a phone number
de: Bitte Telefonnummer angeben

# profile_company_contact_section_success_snackbar_message
source: Company information changed successfully
de: Unternehmensinformationen erfolgreich geändert

# company_requests_overview_title
source: Company Registration Requests
de: Anfragen für Unternehmensregistrierungen

# admin_company_request_detail_title
source: Request
de: Anfrage

# admin_company_request_detail_name
source: Company name:
de: Unternehmensbezeichnung:

# admin_company_request_detail_industry
source: Industry:
de: Branche:

# admin_company_request_detail_address
source: Address:
de: Adresse:

# admin_company_request_detail_postcode
source: Postcode:
de: Postleitzahl:

# admin_company_request_detail_place
source: Place:
de: Ort:

# admin_company_request_detail_phone
source: Phone:
de: Telefonnummer:

# admin_company_request_detail_website
source: Website:
de: Webseite:

# admin_company_request_detail_user_title
source: User
de: Nutzer

# admin_company_request_detail_user_email
source: Email Address:
de: E-Mail Adresse:

# admin_company_request_detail_decline_button_title
source: Decline request
de: Anfrage ablehnen

# admin_company_request_detail_accept_button_title
source: Accept request
de: Anfrage annehmen

# admin_company_request_overview_from_user
source: from:
de: von:

# admin_company_request_overview_empty_title
source: There are no requests
de: Keine Anfragen vorhanden

# admin_company_request_overview_empty_body
source: There dont appear to be any registration requests from companies at this time.
de: Zurzeit scheint es keine Registrierungsanfragen von Unternehmen zu geben.

# admin_company_request_overview_title
source: Requests for company registrations
de: Anfragen für Unternehmensregistrierungen

# admin_company_request_overview_error
source: There was an error
de: Es ist ein Fehler aufgetreten

# company_registration_form_title
source: Register company
de: Unternehmen registrieren

# company_registration_form_name_textfield_placeholder
source: Company name
de: Unternehmensbezeichnung

# company_registration_form_industry_textfield_placeholder
source: Industry
de: Branche

# company_registration_form_website_textfield_placeholder
source: Website (optional)
de: Webseite (optional)

# company_registration_form_address_textfield_placeholder
source: Address
de: Straße und Hausnummer

# company_registration_form_postcode_textfield_placeholder
source: Postcode
de: PLZ

# company_registration_form_place_textfield_placeholder
source: Place
de: Ort

# company_registration_form_phone_textfield_placeholder
source: Phone
de: Telefonnummer

# company_registration_form_register_button_title
source: Register now
de: Jetzt registrieren

# profile_register_company_section_title
source: Company registration
de: Unternehmensregistrierung

# profile_register_company_section_subtitle_in_progress
source: Your request is being processed. The processing time is on average 7 days.
de: Deine Anfrage ist in Bearbeitung. Die Bearbeitungsdauer liegt bei durchschnittlich 7 Tagen.

# profile_register_company_section_subtitle_requested_at
source: Requested at
de: Eingereicht am

# profile_register_company_section_subtitle
source: Register your company now to take advantage of the apps additional benefits.
de: Registriere jetzt dein Unternehmen, um weitere Vorteile der App nutzen zu können.

# profile_register_company_section_button_title
source: Go to registration
de: Zur Registrierung

# profile_image_upload_tooltip
source: Upload image
de: Bild hochladen

# landingpage_overview_edit_tooltip
source: Edit landingpage
de: Landingpage bearbeiten

# landingpage_overview_show_tooltip
source: Show Landingpage
de: Landingpage anzeigen

# profile_edit_email_tooltip
source: Change email address
de: E-Mail Adresse ändern

# theme_switch_lightmode_tooltip
source: Lightmode
de: Heller Modus

# theme_switch_darkmode_tooltip
source: Darkmode
de: Dunkler Modus

# promoter_overview_reset_search_tooltip
source: Reset search
de: Suche zurücksetzen

# promoter_overview_filter_tooltip
source: Filter promoters
de: Promoter filtern

# promoter_overview_view_switch_grid_tooltip
source: Grid view
de: Gridansicht

# promoter_overview_view_switch_table_tooltip
source: List view
de: Listenansicht

# recommendations_form_add_button_tooltip
source: Add recommendation
de: Empfehlung hinzufügen

# landingpage_pagebuilder_container_request_error
source: An error occurred while retrieving the data
de: Beim Abruf der Daten ist ein Fehler aufgetreten

# landingpage_pagebuilder_container_permission_error_title
source: You are not authorized to access this page
de: Du bist nicht berechtigt diese Seite aufzurufen

# landingpage_pagebuilder_container_permission_error_message
source: You do not have the appropriate permission to access this page. Please log in with an account that is authorized to do so.
de: Du hast nicht die entsprechende Berechtigung um diese Seite zu aufzurufen. Melde dich bitte mit einem Account an der dazu berechtigt ist.

# landingpage_pagebuilder_appbar_save_button_title
source: Save
de: Speichern

# landingpage_pagebuilder_save_error_alert_title
source: Save failed
de: Speichern fehlgeschlagen

# landingpage_pagebuilder_save_error_alert_message
source: An error occurred while saving your new landing page content. Please try again later.
de: Beim Speichern deiner neuen Landingpage Inhalte ist ein Fehler aufgetreten. Bitte versuche es später noch einmal.

# landingpage_pagebuilder_save_success_snackbar
source: The changes were saved successfully.
de: Die Änderungen wurden erfolgreich gespeichert.

# landingpage_pagebuilder_image_upload_exceeds_file_size_error
source: The image exceeds the 5 MB limit and cannot be uploaded!
de: Das Bild überschreitet die 5 MB Grenze und kann nicht hochgeladen werden!

# landingpage_pagebuilder_unload_alert_message
source: Do you really want to leave the site? Changes that are not saved will be lost.
de: Willst du die Seite wirklich verlassen? Nicht gespeicherte Änderungen gehen verloren.

# landingpage_pagebuilder_config_menu_content_tab
source: Content
de: Inhalt

# landingpage_pagebuilder_config_menu_column_type
source: Column
de: Spalte

# landingpage_pagebuilder_config_menu_row_type
source: Row
de: Reihe

# landingpage_pagebuilder_config_menu_image_type
source: Image
de: Bild

# landingpage_pagebuilder_config_menu_contact_form_type
source: Contact Form
de: Kontaktformular

# landingpage_pagebuilder_config_menu_unknown_type
source: Unknown
de: Unbekannt

# landingpage_pagebuilder_text_config_text_title
source: Text configuration
de: Text Konfiguration

# landingpage_pagebuilder_text_config_alignment
source: Alignment
de: Ausrichtung

# landingpage_pagebuilder_text_config_alignment_left
source: left-align
de: linksbündig

# landingpage_pagebuilder_text_config_alignment_center
source: center
de: zentriert

# landingpage_pagebuilder_text_config_alignment_right
source: right-align
de: rechtsbündig

# landingpage_pagebuilder_text_config_alignment_justify
source: justify
de: Blocksatz

# landingpage_pagebuilder_text_config_lineheight
source: Line height
de: Zeilenhöhe

# landingpage_pagebuilder_text_config_letterspacing
source: Letter spacing
de: Zeichenabstand

# landingpage_pagebuilder_text_config_color
source: Text color
de: Schriftfarbe

# landingpage_pagebuilder_text_config_font_family
source: Font family
de: Schriftart

# landingpage_pagebuilder_text_config_shadow
source: Text shadow
de: Textschatten

# landingpage_pagebuilder_text_config_shadow_alert_title
source: Configure shadow
de: Schatten konfigurieren

# landingpage_pagebuilder_text_config_shadow_alert_apply
source: Apply
de: Übernehmen

# landingpage_pagebuilder_text_config_fontsize
source: Font size
de: Schriftgröße

# landingpage_pagebuilder_color_picker_title
source: Select color
de: Farbe auswählen

# landingpage_pagebuilder_text_config_text_placeholder
source: Type text here...
de: Hier Text eingeben...

# landingpage_pagebuilder_text_config_content_title
source: Text content
de: Text Inhalt

# landingpage_pagebuilder_layout_spacing_top
source: Top
de: Oben

# landingpage_pagebuilder_layout_spacing_bottom
source: Bottom
de: Unten

# landingpage_pagebuilder_layout_spacing_left
source: Left
de: Links

# landingpage_pagebuilder_layout_spacing_right
source: Right
de: Rechts

# landingpage_pagebuilder_layout_menu_padding
source: Padding
de: Innenabstand

# landingpage_pagebuilder_layout_menu_margin
source: Margin
de: Außenabstand

# landingpage_pagebuilder_layout_menu_alignment
source: Alignment
de: Ausrichtung

# landingpage_pagebuilder_layout_menu_image_control_title
source: Background image
de: Hintergrundbild

# landingpage_pagebuilder_layout_menu_background_contentmode
source: Content mode
de: Anzeigemodus

# landingpage_pagebuilder_layout_menu_background_overlay
source: Image overlay
de: Bild Overlay

# landingpage_pagebuilder_layout_menu_background
source: Background
de: Hintergrund

# landingpage_pagebuilder_layout_menu_background_color
source: Background color
de: Hintergrundfarbe

# pagebuilder_layout_menu_alignment_top_left
source: top left
de: Oben links

# pagebuilder_layout_menu_alignment_top_center
source: top center
de: Oben zentriert

# pagebuilder_layout_menu_alignment_top_right
source: top right
de: Oben rechts

# pagebuilder_layout_menu_alignment_center_left
source: center left
de: Mitte links

# pagebuilder_layout_menu_alignment_center
source: center
de: Mitte

# pagebuilder_layout_menu_alignment_center_right
source: center right
de: Mitte rechts

# pagebuilder_layout_menu_alignment_bottom_left
source: bottom left
de: Unten links

# pagebuilder_layout_menu_alignment_bottom_center
source: bottom center
de: Unten zentriert

# pagebuilder_layout_menu_alignment_bottom_right
source: bottom right
de: Unten rechts

# pagebuilder_layout_menu_size_control_size
source: Size
de: Größe

# pagebuilder_layout_menu_size_control_width
source: Width
de: Breite

# pagebuilder_layout_menu_size_control_height
source: Height
de: Höhe

# pagebuilder_image_config_title
source: Image configuration
de: Bild Konfiguration

# pagebuilder_image_config_content_mode
source: Content mode
de: Bildmodus

# pagebuilder_image_config_image_overlay
source: Image overlay
de: Bild Overlay

# pagebuilder_image_config_image_content
source: Image content
de: Bild Inhalt

# landingpage_pagebuilder_container_config_container_title
source: Container configuration
de: Container Konfiguration

# landingpage_pagebuilder_container_config_container_shadow
source: Shadow
de: Schatten

# landingpage_pagebuilder_row_config_row_title
source: Row configuration
de: Reihe Konfiguration

# landingpage_pagebuilder_row_config_row_equal_heights
source: Equal heights
de: Gleiche Höhen

# landingpage_pagebuilder_row_config_row_main_axis_alignment
source: Alignment x-axis
de: Ausrichtung X-Achse

# landingpage_pagebuilder_row_config_row_cross_axis_alignment
source: Alignment y-axis
de: Ausrichtung Y-Achse

# landingpage_pagebuilder_column_config_column_title
source: Column configuration
de: Spalte Konfiguration

# landingpage_pagebuilder_icon_content
source: Icon content
de: Icon Inhalt

# landingpage_pagebuilder_icon_content_change_icon
source: Change icon
de: Icon ändern

# landingpage_pagebuilder_icon_config_icon_title
source: Icon configuration
de: Icon Konfiguration

# landingpage_pagebuilder_icon_config_color
source: Color
de: Farbe

# landingpage_pagebuilder_icon_config_size
source: Size
de: Größe

# landingpage_pagebuilder_icon_config_icon_picker_title
source: Choose an icon
de: Wähle ein Icon

# landingpage_pagebuilder_icon_config_icon_picker_close
source: Close
de: Schließen

# landingpage_pagebuilder_icon_config_icon_picker_search
source: Search
de: Suche

# landingpage_pagebuilder_icon_config_icon_picker_search_no_results
source: No results for:
de: Keine Ergebnisse für:

# landingpage_pagebuilder_contactform_content_email
source: Contactform email
de: Kontaktformular E-Mail

# landingpage_pagebuilder_contactform_content_email_subtitle
source: Please enter the recipient email address to which the contact request will be sent.
de: Gib hier bitte die Empfänger E-Mail Adresse an, an welche die Kontaktanfrage versendet wird.

# landingpage_pagebuilder_contactform_content_email_placeholder
source: Email address
de: E-Mail Adresse

# pagebuilder_button_config_button_width
source: Width
de: Breite

# pagebuilder_button_config_button_height
source: Height
de: Höhe

# pagebuilder_button_config_button_background_color
source: Background color
de: Hintergrundfarbe

# pagebuilder_button_config_button_text_configuration
source: Button text configuration
de: Button Text Konfiguration

# pagebuilder_contact_form_config_name_textfield_title
source: Name textfield
de: Name Textfeld

# pagebuilder_contact_form_config_email_textfield_title
source: E-Mail textfield
de: E-Mail Textfeld

# pagebuilder_contact_form_config_phone_textfield_title
source: Phone textfield
de: Telefon Textfeld

# pagebuilder_contact_form_config_message_textfield_title
source: Message textfield
de: Nachricht Textfeld

# pagebuilder_contact_form_config_button_title
source: Button configuration
de: Button Konfiguration

# pagebuilder_textfield_config_textfield_width
source: Width
de: Breite

# pagebuilder_textfield_config_textfield_min_lines
source: Number of lines min
de: Zeilenanzahl Minimum

# pagebuilder_textfield_config_textfield_max_lines
source: Number of lines max
de: Zeilenanzahl Maximum

# pagebuilder_textfield_config_textfield_required
source: Required field
de: Pflichtfeld

# pagebuilder_textfield_config_textfield_background_color
source: Background color
de: Hintergrundfarbe

# pagebuilder_textfield_config_textfield_border_color
source: Border color
de: Rahmenfarbe

# pagebuilder_textfield_config_textfield_placeholder
source: Placeholder
de: Platzhalter

# pagebuilder_textfield_config_textfield_text_configuration
source: Textfield text configuration
de: Textfeld Text Konfiguration

# pagebuilder_textfield_config_textfield_placeholder_text_configuration
source: Textfield placeholder configuration
de: Textfeld Platzhalter Konfiguration
